/* automatically generated by rust-bindgen 0.71.1 */

pub const VEF_MAX_ERROR_LEN: u32 = 512;
pub const VEF_PARAM_VARARGS: u32 = 4294967295;
pub const VEF_MAX_TYPE_PARAMS_STRING_LEN: u32 = 1024;
pub const VEF_REGISTER_FUNC_NAME: &[u8; 13] = b"vef_register\0";
pub const VEF_UNREGISTER_FUNC_NAME: &[u8; 15] = b"vef_unregister\0";
pub const vef_protocol_t_VEF_PROTOCOL_0: vef_protocol_t = 0;
pub const vef_protocol_t_VEF_PROTOCOL_1: vef_protocol_t = 1;
pub const vef_protocol_t_VEF_PROTOCOL_2: vef_protocol_t = 2;
pub const vef_protocol_t_VEF_PROTOCOL_3: vef_protocol_t = 3;
pub type vef_protocol_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vef_version_t {
    pub major: ::std::os::raw::c_uint,
    pub minor: ::std::os::raw::c_uint,
    pub patch: ::std::os::raw::c_uint,
    pub extra: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vef_version_t"][::std::mem::size_of::<vef_version_t>() - 24usize];
    ["Alignment of vef_version_t"][::std::mem::align_of::<vef_version_t>() - 8usize];
    ["Offset of field: vef_version_t::major"]
        [::std::mem::offset_of!(vef_version_t, major) - 0usize];
    ["Offset of field: vef_version_t::minor"]
        [::std::mem::offset_of!(vef_version_t, minor) - 4usize];
    ["Offset of field: vef_version_t::patch"]
        [::std::mem::offset_of!(vef_version_t, patch) - 8usize];
    ["Offset of field: vef_version_t::extra"]
        [::std::mem::offset_of!(vef_version_t, extra) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vef_context_t {
    pub protocol: vef_protocol_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vef_context_t"][::std::mem::size_of::<vef_context_t>() - 4usize];
    ["Alignment of vef_context_t"][::std::mem::align_of::<vef_context_t>() - 4usize];
    ["Offset of field: vef_context_t::protocol"]
        [::std::mem::offset_of!(vef_context_t, protocol) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vef_register_arg_t {
    pub protocol: vef_protocol_t,
    pub mysql_version: vef_version_t,
    pub vef_version: vef_version_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vef_register_arg_t"][::std::mem::size_of::<vef_register_arg_t>() - 56usize];
    ["Alignment of vef_register_arg_t"][::std::mem::align_of::<vef_register_arg_t>() - 8usize];
    ["Offset of field: vef_register_arg_t::protocol"]
        [::std::mem::offset_of!(vef_register_arg_t, protocol) - 0usize];
    ["Offset of field: vef_register_arg_t::mysql_version"]
        [::std::mem::offset_of!(vef_register_arg_t, mysql_version) - 8usize];
    ["Offset of field: vef_register_arg_t::vef_version"]
        [::std::mem::offset_of!(vef_register_arg_t, vef_version) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vef_unregister_arg_t {
    pub protocol: vef_protocol_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vef_unregister_arg_t"][::std::mem::size_of::<vef_unregister_arg_t>() - 4usize];
    ["Alignment of vef_unregister_arg_t"][::std::mem::align_of::<vef_unregister_arg_t>() - 4usize];
    ["Offset of field: vef_unregister_arg_t::protocol"]
        [::std::mem::offset_of!(vef_unregister_arg_t, protocol) - 0usize];
};
pub const vef_type_id_VEF_TYPE_STRING: vef_type_id = 0;
pub const vef_type_id_VEF_TYPE_REAL: vef_type_id = 1;
pub const vef_type_id_VEF_TYPE_INT: vef_type_id = 2;
pub const vef_type_id_VEF_TYPE_CUSTOM: vef_type_id = 3;
pub type vef_type_id = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct vef_invalue_v1_t {
    pub type_: vef_type_id,
    pub is_null: bool,
    pub __bindgen_anon_1: vef_invalue_v1_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vef_invalue_v1_t__bindgen_ty_1 {
    pub __bindgen_anon_1: vef_invalue_v1_t__bindgen_ty_1__bindgen_ty_1,
    pub __bindgen_anon_2: vef_invalue_v1_t__bindgen_ty_1__bindgen_ty_2,
    pub real_value: f64,
    pub int_value: ::std::os::raw::c_longlong,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vef_invalue_v1_t__bindgen_ty_1__bindgen_ty_1 {
    pub str_len: usize,
    pub str_value: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vef_invalue_v1_t__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<vef_invalue_v1_t__bindgen_ty_1__bindgen_ty_1>() - 16usize];
    ["Alignment of vef_invalue_v1_t__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<vef_invalue_v1_t__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: vef_invalue_v1_t__bindgen_ty_1__bindgen_ty_1::str_len"]
        [::std::mem::offset_of!(vef_invalue_v1_t__bindgen_ty_1__bindgen_ty_1, str_len) - 0usize];
    ["Offset of field: vef_invalue_v1_t__bindgen_ty_1__bindgen_ty_1::str_value"]
        [::std::mem::offset_of!(vef_invalue_v1_t__bindgen_ty_1__bindgen_ty_1, str_value) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vef_invalue_v1_t__bindgen_ty_1__bindgen_ty_2 {
    pub bin_len: usize,
    pub bin_value: *const ::std::os::raw::c_uchar,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vef_invalue_v1_t__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::size_of::<vef_invalue_v1_t__bindgen_ty_1__bindgen_ty_2>() - 16usize];
    ["Alignment of vef_invalue_v1_t__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::align_of::<vef_invalue_v1_t__bindgen_ty_1__bindgen_ty_2>() - 8usize];
    ["Offset of field: vef_invalue_v1_t__bindgen_ty_1__bindgen_ty_2::bin_len"]
        [::std::mem::offset_of!(vef_invalue_v1_t__bindgen_ty_1__bindgen_ty_2, bin_len) - 0usize];
    ["Offset of field: vef_invalue_v1_t__bindgen_ty_1__bindgen_ty_2::bin_value"]
        [::std::mem::offset_of!(vef_invalue_v1_t__bindgen_ty_1__bindgen_ty_2, bin_value) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vef_invalue_v1_t__bindgen_ty_1"]
        [::std::mem::size_of::<vef_invalue_v1_t__bindgen_ty_1>() - 16usize];
    ["Alignment of vef_invalue_v1_t__bindgen_ty_1"]
        [::std::mem::align_of::<vef_invalue_v1_t__bindgen_ty_1>() - 8usize];
    ["Offset of field: vef_invalue_v1_t__bindgen_ty_1::real_value"]
        [::std::mem::offset_of!(vef_invalue_v1_t__bindgen_ty_1, real_value) - 0usize];
    ["Offset of field: vef_invalue_v1_t__bindgen_ty_1::int_value"]
        [::std::mem::offset_of!(vef_invalue_v1_t__bindgen_ty_1, int_value) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vef_invalue_v1_t"][::std::mem::size_of::<vef_invalue_v1_t>() - 24usize];
    ["Alignment of vef_invalue_v1_t"][::std::mem::align_of::<vef_invalue_v1_t>() - 8usize];
    ["Offset of field: vef_invalue_v1_t::type_"]
        [::std::mem::offset_of!(vef_invalue_v1_t, type_) - 0usize];
    ["Offset of field: vef_invalue_v1_t::is_null"]
        [::std::mem::offset_of!(vef_invalue_v1_t, is_null) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vef_type_params_t {
    pub count: ::std::os::raw::c_uint,
    pub keys: *const *const ::std::os::raw::c_char,
    pub values: *const *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vef_type_params_t"][::std::mem::size_of::<vef_type_params_t>() - 24usize];
    ["Alignment of vef_type_params_t"][::std::mem::align_of::<vef_type_params_t>() - 8usize];
    ["Offset of field: vef_type_params_t::count"]
        [::std::mem::offset_of!(vef_type_params_t, count) - 0usize];
    ["Offset of field: vef_type_params_t::keys"]
        [::std::mem::offset_of!(vef_type_params_t, keys) - 8usize];
    ["Offset of field: vef_type_params_t::values"]
        [::std::mem::offset_of!(vef_type_params_t, values) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vef_inferred_type_params_t {
    pub buf: *mut ::std::os::raw::c_char,
    pub max_buf_len: usize,
    pub actual_len: usize,
    pub overflow: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vef_inferred_type_params_t"]
        [::std::mem::size_of::<vef_inferred_type_params_t>() - 32usize];
    ["Alignment of vef_inferred_type_params_t"]
        [::std::mem::align_of::<vef_inferred_type_params_t>() - 8usize];
    ["Offset of field: vef_inferred_type_params_t::buf"]
        [::std::mem::offset_of!(vef_inferred_type_params_t, buf) - 0usize];
    ["Offset of field: vef_inferred_type_params_t::max_buf_len"]
        [::std::mem::offset_of!(vef_inferred_type_params_t, max_buf_len) - 8usize];
    ["Offset of field: vef_inferred_type_params_t::actual_len"]
        [::std::mem::offset_of!(vef_inferred_type_params_t, actual_len) - 16usize];
    ["Offset of field: vef_inferred_type_params_t::overflow"]
        [::std::mem::offset_of!(vef_inferred_type_params_t, overflow) - 24usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct vef_invalue_t {
    pub type_: vef_type_id,
    pub is_null: bool,
    pub __bindgen_anon_1: vef_invalue_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vef_invalue_t__bindgen_ty_1 {
    pub __bindgen_anon_1: vef_invalue_t__bindgen_ty_1__bindgen_ty_1,
    pub __bindgen_anon_2: vef_invalue_t__bindgen_ty_1__bindgen_ty_2,
    pub real_value: f64,
    pub int_value: ::std::os::raw::c_longlong,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vef_invalue_t__bindgen_ty_1__bindgen_ty_1 {
    pub str_len: usize,
    pub str_value: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vef_invalue_t__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<vef_invalue_t__bindgen_ty_1__bindgen_ty_1>() - 16usize];
    ["Alignment of vef_invalue_t__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<vef_invalue_t__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: vef_invalue_t__bindgen_ty_1__bindgen_ty_1::str_len"]
        [::std::mem::offset_of!(vef_invalue_t__bindgen_ty_1__bindgen_ty_1, str_len) - 0usize];
    ["Offset of field: vef_invalue_t__bindgen_ty_1__bindgen_ty_1::str_value"]
        [::std::mem::offset_of!(vef_invalue_t__bindgen_ty_1__bindgen_ty_1, str_value) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vef_invalue_t__bindgen_ty_1__bindgen_ty_2 {
    pub bin_len: usize,
    pub bin_value: *const ::std::os::raw::c_uchar,
    pub type_params: vef_type_params_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vef_invalue_t__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::size_of::<vef_invalue_t__bindgen_ty_1__bindgen_ty_2>() - 40usize];
    ["Alignment of vef_invalue_t__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::align_of::<vef_invalue_t__bindgen_ty_1__bindgen_ty_2>() - 8usize];
    ["Offset of field: vef_invalue_t__bindgen_ty_1__bindgen_ty_2::bin_len"]
        [::std::mem::offset_of!(vef_invalue_t__bindgen_ty_1__bindgen_ty_2, bin_len) - 0usize];
    ["Offset of field: vef_invalue_t__bindgen_ty_1__bindgen_ty_2::bin_value"]
        [::std::mem::offset_of!(vef_invalue_t__bindgen_ty_1__bindgen_ty_2, bin_value) - 8usize];
    ["Offset of field: vef_invalue_t__bindgen_ty_1__bindgen_ty_2::type_params"]
        [::std::mem::offset_of!(vef_invalue_t__bindgen_ty_1__bindgen_ty_2, type_params) - 16usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vef_invalue_t__bindgen_ty_1"]
        [::std::mem::size_of::<vef_invalue_t__bindgen_ty_1>() - 40usize];
    ["Alignment of vef_invalue_t__bindgen_ty_1"]
        [::std::mem::align_of::<vef_invalue_t__bindgen_ty_1>() - 8usize];
    ["Offset of field: vef_invalue_t__bindgen_ty_1::real_value"]
        [::std::mem::offset_of!(vef_invalue_t__bindgen_ty_1, real_value) - 0usize];
    ["Offset of field: vef_invalue_t__bindgen_ty_1::int_value"]
        [::std::mem::offset_of!(vef_invalue_t__bindgen_ty_1, int_value) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vef_invalue_t"][::std::mem::size_of::<vef_invalue_t>() - 48usize];
    ["Alignment of vef_invalue_t"][::std::mem::align_of::<vef_invalue_t>() - 8usize];
    ["Offset of field: vef_invalue_t::type_"]
        [::std::mem::offset_of!(vef_invalue_t, type_) - 0usize];
    ["Offset of field: vef_invalue_t::is_null"]
        [::std::mem::offset_of!(vef_invalue_t, is_null) - 4usize];
};
pub const vef_return_value_type_t_VEF_RESULT_VALUE: vef_return_value_type_t = 0;
pub const vef_return_value_type_t_VEF_RESULT_NULL: vef_return_value_type_t = 1;
pub const vef_return_value_type_t_VEF_RESULT_WARNING: vef_return_value_type_t = 2;
pub const vef_return_value_type_t_VEF_RESULT_ERROR: vef_return_value_type_t = 3;
pub type vef_return_value_type_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct vef_vdf_result_t {
    pub type_: vef_return_value_type_t,
    pub actual_len: usize,
    pub error_msg: *mut ::std::os::raw::c_char,
    pub __bindgen_anon_1: vef_vdf_result_t__bindgen_ty_1,
    pub out_type_params: *mut vef_inferred_type_params_t,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vef_vdf_result_t__bindgen_ty_1 {
    pub __bindgen_anon_1: vef_vdf_result_t__bindgen_ty_1__bindgen_ty_1,
    pub __bindgen_anon_2: vef_vdf_result_t__bindgen_ty_1__bindgen_ty_2,
    pub real_value: f64,
    pub int_value: ::std::os::raw::c_longlong,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vef_vdf_result_t__bindgen_ty_1__bindgen_ty_1 {
    pub str_buf: *mut ::std::os::raw::c_char,
    pub max_str_len: usize,
    pub alt_str_buf: *mut *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vef_vdf_result_t__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<vef_vdf_result_t__bindgen_ty_1__bindgen_ty_1>() - 24usize];
    ["Alignment of vef_vdf_result_t__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<vef_vdf_result_t__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: vef_vdf_result_t__bindgen_ty_1__bindgen_ty_1::str_buf"]
        [::std::mem::offset_of!(vef_vdf_result_t__bindgen_ty_1__bindgen_ty_1, str_buf) - 0usize];
    ["Offset of field: vef_vdf_result_t__bindgen_ty_1__bindgen_ty_1::max_str_len"][::std::mem::offset_of!(
        vef_vdf_result_t__bindgen_ty_1__bindgen_ty_1,
        max_str_len
    ) - 8usize];
    ["Offset of field: vef_vdf_result_t__bindgen_ty_1__bindgen_ty_1::alt_str_buf"][::std::mem::offset_of!(
        vef_vdf_result_t__bindgen_ty_1__bindgen_ty_1,
        alt_str_buf
    ) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vef_vdf_result_t__bindgen_ty_1__bindgen_ty_2 {
    pub bin_buf: *mut ::std::os::raw::c_uchar,
    pub max_bin_len: usize,
    pub alt_bin_buf: *mut *mut ::std::os::raw::c_uchar,
    pub type_params: vef_type_params_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vef_vdf_result_t__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::size_of::<vef_vdf_result_t__bindgen_ty_1__bindgen_ty_2>() - 48usize];
    ["Alignment of vef_vdf_result_t__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::align_of::<vef_vdf_result_t__bindgen_ty_1__bindgen_ty_2>() - 8usize];
    ["Offset of field: vef_vdf_result_t__bindgen_ty_1__bindgen_ty_2::bin_buf"]
        [::std::mem::offset_of!(vef_vdf_result_t__bindgen_ty_1__bindgen_ty_2, bin_buf) - 0usize];
    ["Offset of field: vef_vdf_result_t__bindgen_ty_1__bindgen_ty_2::max_bin_len"][::std::mem::offset_of!(
        vef_vdf_result_t__bindgen_ty_1__bindgen_ty_2,
        max_bin_len
    ) - 8usize];
    ["Offset of field: vef_vdf_result_t__bindgen_ty_1__bindgen_ty_2::alt_bin_buf"][::std::mem::offset_of!(
        vef_vdf_result_t__bindgen_ty_1__bindgen_ty_2,
        alt_bin_buf
    ) - 16usize];
    ["Offset of field: vef_vdf_result_t__bindgen_ty_1__bindgen_ty_2::type_params"][::std::mem::offset_of!(
        vef_vdf_result_t__bindgen_ty_1__bindgen_ty_2,
        type_params
    ) - 24usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vef_vdf_result_t__bindgen_ty_1"]
        [::std::mem::size_of::<vef_vdf_result_t__bindgen_ty_1>() - 48usize];
    ["Alignment of vef_vdf_result_t__bindgen_ty_1"]
        [::std::mem::align_of::<vef_vdf_result_t__bindgen_ty_1>() - 8usize];
    ["Offset of field: vef_vdf_result_t__bindgen_ty_1::real_value"]
        [::std::mem::offset_of!(vef_vdf_result_t__bindgen_ty_1, real_value) - 0usize];
    ["Offset of field: vef_vdf_result_t__bindgen_ty_1::int_value"]
        [::std::mem::offset_of!(vef_vdf_result_t__bindgen_ty_1, int_value) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vef_vdf_result_t"][::std::mem::size_of::<vef_vdf_result_t>() - 80usize];
    ["Alignment of vef_vdf_result_t"][::std::mem::align_of::<vef_vdf_result_t>() - 8usize];
    ["Offset of field: vef_vdf_result_t::type_"]
        [::std::mem::offset_of!(vef_vdf_result_t, type_) - 0usize];
    ["Offset of field: vef_vdf_result_t::actual_len"]
        [::std::mem::offset_of!(vef_vdf_result_t, actual_len) - 8usize];
    ["Offset of field: vef_vdf_result_t::error_msg"]
        [::std::mem::offset_of!(vef_vdf_result_t, error_msg) - 16usize];
    ["Offset of field: vef_vdf_result_t::out_type_params"]
        [::std::mem::offset_of!(vef_vdf_result_t, out_type_params) - 72usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct vef_vdf_args_t {
    pub user_data: *mut ::std::os::raw::c_void,
    pub value_count: ::std::os::raw::c_uint,
    pub __bindgen_anon_1: vef_vdf_args_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vef_vdf_args_t__bindgen_ty_1 {
    pub values_v1: *mut vef_invalue_v1_t,
    pub values: *mut *mut vef_invalue_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vef_vdf_args_t__bindgen_ty_1"]
        [::std::mem::size_of::<vef_vdf_args_t__bindgen_ty_1>() - 8usize];
    ["Alignment of vef_vdf_args_t__bindgen_ty_1"]
        [::std::mem::align_of::<vef_vdf_args_t__bindgen_ty_1>() - 8usize];
    ["Offset of field: vef_vdf_args_t__bindgen_ty_1::values_v1"]
        [::std::mem::offset_of!(vef_vdf_args_t__bindgen_ty_1, values_v1) - 0usize];
    ["Offset of field: vef_vdf_args_t__bindgen_ty_1::values"]
        [::std::mem::offset_of!(vef_vdf_args_t__bindgen_ty_1, values) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vef_vdf_args_t"][::std::mem::size_of::<vef_vdf_args_t>() - 24usize];
    ["Alignment of vef_vdf_args_t"][::std::mem::align_of::<vef_vdf_args_t>() - 8usize];
    ["Offset of field: vef_vdf_args_t::user_data"]
        [::std::mem::offset_of!(vef_vdf_args_t, user_data) - 0usize];
    ["Offset of field: vef_vdf_args_t::value_count"]
        [::std::mem::offset_of!(vef_vdf_args_t, value_count) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vef_type_t {
    pub id: vef_type_id,
    pub custom_type: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vef_type_t"][::std::mem::size_of::<vef_type_t>() - 16usize];
    ["Alignment of vef_type_t"][::std::mem::align_of::<vef_type_t>() - 8usize];
    ["Offset of field: vef_type_t::id"][::std::mem::offset_of!(vef_type_t, id) - 0usize];
    ["Offset of field: vef_type_t::custom_type"]
        [::std::mem::offset_of!(vef_type_t, custom_type) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vef_signature_t {
    pub param_count: ::std::os::raw::c_uint,
    pub params: *const vef_type_t,
    pub return_type: vef_type_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vef_signature_t"][::std::mem::size_of::<vef_signature_t>() - 32usize];
    ["Alignment of vef_signature_t"][::std::mem::align_of::<vef_signature_t>() - 8usize];
    ["Offset of field: vef_signature_t::param_count"]
        [::std::mem::offset_of!(vef_signature_t, param_count) - 0usize];
    ["Offset of field: vef_signature_t::params"]
        [::std::mem::offset_of!(vef_signature_t, params) - 8usize];
    ["Offset of field: vef_signature_t::return_type"]
        [::std::mem::offset_of!(vef_signature_t, return_type) - 16usize];
};
pub type vef_vdf_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut vef_context_t,
        args: *mut vef_vdf_args_t,
        result: *mut vef_vdf_result_t,
    ),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vef_prerun_args_t {
    pub arg_count: ::std::os::raw::c_uint,
    pub arg_types: *mut vef_type_t,
    pub const_values: *mut *mut ::std::os::raw::c_char,
    pub const_lengths: *mut usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vef_prerun_args_t"][::std::mem::size_of::<vef_prerun_args_t>() - 32usize];
    ["Alignment of vef_prerun_args_t"][::std::mem::align_of::<vef_prerun_args_t>() - 8usize];
    ["Offset of field: vef_prerun_args_t::arg_count"]
        [::std::mem::offset_of!(vef_prerun_args_t, arg_count) - 0usize];
    ["Offset of field: vef_prerun_args_t::arg_types"]
        [::std::mem::offset_of!(vef_prerun_args_t, arg_types) - 8usize];
    ["Offset of field: vef_prerun_args_t::const_values"]
        [::std::mem::offset_of!(vef_prerun_args_t, const_values) - 16usize];
    ["Offset of field: vef_prerun_args_t::const_lengths"]
        [::std::mem::offset_of!(vef_prerun_args_t, const_lengths) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vef_prerun_result_t {
    pub type_: vef_return_value_type_t,
    pub error_msg: *mut ::std::os::raw::c_char,
    pub result_buffer_size: usize,
    pub user_data: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vef_prerun_result_t"][::std::mem::size_of::<vef_prerun_result_t>() - 32usize];
    ["Alignment of vef_prerun_result_t"][::std::mem::align_of::<vef_prerun_result_t>() - 8usize];
    ["Offset of field: vef_prerun_result_t::type_"]
        [::std::mem::offset_of!(vef_prerun_result_t, type_) - 0usize];
    ["Offset of field: vef_prerun_result_t::error_msg"]
        [::std::mem::offset_of!(vef_prerun_result_t, error_msg) - 8usize];
    ["Offset of field: vef_prerun_result_t::result_buffer_size"]
        [::std::mem::offset_of!(vef_prerun_result_t, result_buffer_size) - 16usize];
    ["Offset of field: vef_prerun_result_t::user_data"]
        [::std::mem::offset_of!(vef_prerun_result_t, user_data) - 24usize];
};
pub type vef_prerun_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut vef_context_t,
        args: *mut vef_prerun_args_t,
        result: *mut vef_prerun_result_t,
    ),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vef_postrun_args_t {
    pub user_data: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vef_postrun_args_t"][::std::mem::size_of::<vef_postrun_args_t>() - 8usize];
    ["Alignment of vef_postrun_args_t"][::std::mem::align_of::<vef_postrun_args_t>() - 8usize];
    ["Offset of field: vef_postrun_args_t::user_data"]
        [::std::mem::offset_of!(vef_postrun_args_t, user_data) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vef_postrun_result_t {
    pub _address: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vef_postrun_result_t"][::std::mem::size_of::<vef_postrun_result_t>() - 1usize];
    ["Alignment of vef_postrun_result_t"][::std::mem::align_of::<vef_postrun_result_t>() - 1usize];
};
pub type vef_postrun_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut vef_context_t,
        args: *mut vef_postrun_args_t,
        result: *mut vef_postrun_result_t,
    ),
>;
pub type vef_vdf_clear_func_t =
    ::std::option::Option<unsafe extern "C" fn(ctx: *mut vef_context_t, args: *mut vef_vdf_args_t)>;
pub type vef_vdf_accumulate_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut vef_context_t,
        args: *mut vef_vdf_args_t,
        result: *mut vef_vdf_result_t,
    ),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vef_func_desc_t {
    pub protocol: vef_protocol_t,
    pub name: *const ::std::os::raw::c_char,
    pub signature: *mut vef_signature_t,
    pub vdf: vef_vdf_func_t,
    pub prerun: vef_prerun_func_t,
    pub postrun: vef_postrun_func_t,
    pub buffer_size: usize,
    pub deterministic: bool,
    pub clear: vef_vdf_clear_func_t,
    pub accumulate: vef_vdf_accumulate_func_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vef_func_desc_t"][::std::mem::size_of::<vef_func_desc_t>() - 80usize];
    ["Alignment of vef_func_desc_t"][::std::mem::align_of::<vef_func_desc_t>() - 8usize];
    ["Offset of field: vef_func_desc_t::protocol"]
        [::std::mem::offset_of!(vef_func_desc_t, protocol) - 0usize];
    ["Offset of field: vef_func_desc_t::name"]
        [::std::mem::offset_of!(vef_func_desc_t, name) - 8usize];
    ["Offset of field: vef_func_desc_t::signature"]
        [::std::mem::offset_of!(vef_func_desc_t, signature) - 16usize];
    ["Offset of field: vef_func_desc_t::vdf"]
        [::std::mem::offset_of!(vef_func_desc_t, vdf) - 24usize];
    ["Offset of field: vef_func_desc_t::prerun"]
        [::std::mem::offset_of!(vef_func_desc_t, prerun) - 32usize];
    ["Offset of field: vef_func_desc_t::postrun"]
        [::std::mem::offset_of!(vef_func_desc_t, postrun) - 40usize];
    ["Offset of field: vef_func_desc_t::buffer_size"]
        [::std::mem::offset_of!(vef_func_desc_t, buffer_size) - 48usize];
    ["Offset of field: vef_func_desc_t::deterministic"]
        [::std::mem::offset_of!(vef_func_desc_t, deterministic) - 56usize];
    ["Offset of field: vef_func_desc_t::clear"]
        [::std::mem::offset_of!(vef_func_desc_t, clear) - 64usize];
    ["Offset of field: vef_func_desc_t::accumulate"]
        [::std::mem::offset_of!(vef_func_desc_t, accumulate) - 72usize];
};
pub type vef_encode_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        buffer: *mut ::std::os::raw::c_uchar,
        buffer_size: usize,
        from: *const ::std::os::raw::c_char,
        from_len: usize,
        length: *mut usize,
    ) -> bool,
>;
pub type vef_decode_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        buffer: *const ::std::os::raw::c_uchar,
        buffer_size: usize,
        to: *mut ::std::os::raw::c_char,
        to_size: usize,
        to_length: *mut usize,
    ) -> bool,
>;
pub type vef_compare_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        data1: *const ::std::os::raw::c_uchar,
        len1: usize,
        data2: *const ::std::os::raw::c_uchar,
        len2: usize,
    ) -> ::std::os::raw::c_int,
>;
pub type vef_hash_func_t = ::std::option::Option<
    unsafe extern "C" fn(data: *const ::std::os::raw::c_uchar, len: usize) -> usize,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vef_type_desc_t {
    pub protocol: vef_protocol_t,
    pub name: *const ::std::os::raw::c_char,
    pub persisted_length: i64,
    pub max_decode_buffer_length: i64,
    pub encode_func: vef_encode_func_t,
    pub decode_func: vef_decode_func_t,
    pub compare_func: vef_compare_func_t,
    pub hash_func: vef_hash_func_t,
    pub encode_vdf_name: *const ::std::os::raw::c_char,
    pub decode_vdf_name: *const ::std::os::raw::c_char,
    pub compare_vdf_name: *const ::std::os::raw::c_char,
    pub hash_vdf_name: *const ::std::os::raw::c_char,
    pub int_to_params_vdf_name: *const ::std::os::raw::c_char,
    pub resolve_params_vdf_name: *const ::std::os::raw::c_char,
    pub intrinsic_default_vdf_name: *const ::std::os::raw::c_char,
    pub intrinsic_default_str: *const ::std::os::raw::c_char,
    pub max_persisted_length: i64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vef_type_desc_t"][::std::mem::size_of::<vef_type_desc_t>() - 136usize];
    ["Alignment of vef_type_desc_t"][::std::mem::align_of::<vef_type_desc_t>() - 8usize];
    ["Offset of field: vef_type_desc_t::protocol"]
        [::std::mem::offset_of!(vef_type_desc_t, protocol) - 0usize];
    ["Offset of field: vef_type_desc_t::name"]
        [::std::mem::offset_of!(vef_type_desc_t, name) - 8usize];
    ["Offset of field: vef_type_desc_t::persisted_length"]
        [::std::mem::offset_of!(vef_type_desc_t, persisted_length) - 16usize];
    ["Offset of field: vef_type_desc_t::max_decode_buffer_length"]
        [::std::mem::offset_of!(vef_type_desc_t, max_decode_buffer_length) - 24usize];
    ["Offset of field: vef_type_desc_t::encode_func"]
        [::std::mem::offset_of!(vef_type_desc_t, encode_func) - 32usize];
    ["Offset of field: vef_type_desc_t::decode_func"]
        [::std::mem::offset_of!(vef_type_desc_t, decode_func) - 40usize];
    ["Offset of field: vef_type_desc_t::compare_func"]
        [::std::mem::offset_of!(vef_type_desc_t, compare_func) - 48usize];
    ["Offset of field: vef_type_desc_t::hash_func"]
        [::std::mem::offset_of!(vef_type_desc_t, hash_func) - 56usize];
    ["Offset of field: vef_type_desc_t::encode_vdf_name"]
        [::std::mem::offset_of!(vef_type_desc_t, encode_vdf_name) - 64usize];
    ["Offset of field: vef_type_desc_t::decode_vdf_name"]
        [::std::mem::offset_of!(vef_type_desc_t, decode_vdf_name) - 72usize];
    ["Offset of field: vef_type_desc_t::compare_vdf_name"]
        [::std::mem::offset_of!(vef_type_desc_t, compare_vdf_name) - 80usize];
    ["Offset of field: vef_type_desc_t::hash_vdf_name"]
        [::std::mem::offset_of!(vef_type_desc_t, hash_vdf_name) - 88usize];
    ["Offset of field: vef_type_desc_t::int_to_params_vdf_name"]
        [::std::mem::offset_of!(vef_type_desc_t, int_to_params_vdf_name) - 96usize];
    ["Offset of field: vef_type_desc_t::resolve_params_vdf_name"]
        [::std::mem::offset_of!(vef_type_desc_t, resolve_params_vdf_name) - 104usize];
    ["Offset of field: vef_type_desc_t::intrinsic_default_vdf_name"]
        [::std::mem::offset_of!(vef_type_desc_t, intrinsic_default_vdf_name) - 112usize];
    ["Offset of field: vef_type_desc_t::intrinsic_default_str"]
        [::std::mem::offset_of!(vef_type_desc_t, intrinsic_default_str) - 120usize];
    ["Offset of field: vef_type_desc_t::max_persisted_length"]
        [::std::mem::offset_of!(vef_type_desc_t, max_persisted_length) - 128usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vef_required_capability_t {
    pub name: *const ::std::os::raw::c_char,
    pub vtable_hash: *const ::std::os::raw::c_char,
    pub vtable_dest: *mut *mut ::std::os::raw::c_void,
    pub capability_config_hash: *const ::std::os::raw::c_char,
    pub capability_config: *const ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vef_required_capability_t"]
        [::std::mem::size_of::<vef_required_capability_t>() - 40usize];
    ["Alignment of vef_required_capability_t"]
        [::std::mem::align_of::<vef_required_capability_t>() - 8usize];
    ["Offset of field: vef_required_capability_t::name"]
        [::std::mem::offset_of!(vef_required_capability_t, name) - 0usize];
    ["Offset of field: vef_required_capability_t::vtable_hash"]
        [::std::mem::offset_of!(vef_required_capability_t, vtable_hash) - 8usize];
    ["Offset of field: vef_required_capability_t::vtable_dest"]
        [::std::mem::offset_of!(vef_required_capability_t, vtable_dest) - 16usize];
    ["Offset of field: vef_required_capability_t::capability_config_hash"]
        [::std::mem::offset_of!(vef_required_capability_t, capability_config_hash) - 24usize];
    ["Offset of field: vef_required_capability_t::capability_config"]
        [::std::mem::offset_of!(vef_required_capability_t, capability_config) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vef_registration_t {
    pub protocol: vef_protocol_t,
    pub error_msg: *mut ::std::os::raw::c_char,
    pub deprecated_extension_version: *const ::std::os::raw::c_char,
    pub sdk_version: vef_version_t,
    pub deprecated_extension_name: *const ::std::os::raw::c_char,
    pub func_count: ::std::os::raw::c_uint,
    pub funcs: *mut *mut vef_func_desc_t,
    pub type_count: ::std::os::raw::c_uint,
    pub types: *mut *mut vef_type_desc_t,
    pub required_capability_count: ::std::os::raw::c_uint,
    pub required_capabilities: *const vef_required_capability_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vef_registration_t"][::std::mem::size_of::<vef_registration_t>() - 104usize];
    ["Alignment of vef_registration_t"][::std::mem::align_of::<vef_registration_t>() - 8usize];
    ["Offset of field: vef_registration_t::protocol"]
        [::std::mem::offset_of!(vef_registration_t, protocol) - 0usize];
    ["Offset of field: vef_registration_t::error_msg"]
        [::std::mem::offset_of!(vef_registration_t, error_msg) - 8usize];
    ["Offset of field: vef_registration_t::deprecated_extension_version"]
        [::std::mem::offset_of!(vef_registration_t, deprecated_extension_version) - 16usize];
    ["Offset of field: vef_registration_t::sdk_version"]
        [::std::mem::offset_of!(vef_registration_t, sdk_version) - 24usize];
    ["Offset of field: vef_registration_t::deprecated_extension_name"]
        [::std::mem::offset_of!(vef_registration_t, deprecated_extension_name) - 48usize];
    ["Offset of field: vef_registration_t::func_count"]
        [::std::mem::offset_of!(vef_registration_t, func_count) - 56usize];
    ["Offset of field: vef_registration_t::funcs"]
        [::std::mem::offset_of!(vef_registration_t, funcs) - 64usize];
    ["Offset of field: vef_registration_t::type_count"]
        [::std::mem::offset_of!(vef_registration_t, type_count) - 72usize];
    ["Offset of field: vef_registration_t::types"]
        [::std::mem::offset_of!(vef_registration_t, types) - 80usize];
    ["Offset of field: vef_registration_t::required_capability_count"]
        [::std::mem::offset_of!(vef_registration_t, required_capability_count) - 88usize];
    ["Offset of field: vef_registration_t::required_capabilities"]
        [::std::mem::offset_of!(vef_registration_t, required_capabilities) - 96usize];
};
pub type vef_register_func_t = ::std::option::Option<
    unsafe extern "C" fn(arg: *mut vef_register_arg_t) -> *mut vef_registration_t,
>;
pub type vef_unregister_func_t = ::std::option::Option<
    unsafe extern "C" fn(arg: *mut vef_unregister_arg_t, registration: *mut vef_registration_t),
>;
