/* automatically generated by rust-bindgen 0.71.1 */

pub const VEF_PREVIEW_SYS_VAR_NAME: &[u8; 14] = b"vsql::sys_var\0";
pub const VEF_PREVIEW_SYS_VAR_ABI_VERSION: u32 = 1;
pub const vef_var_type_t_VEF_VAR_BOOL: vef_var_type_t = 0;
pub const vef_var_type_t_VEF_VAR_INT: vef_var_type_t = 1;
pub const vef_var_type_t_VEF_VAR_DOUBLE: vef_var_type_t = 2;
pub const vef_var_type_t_VEF_VAR_STR: vef_var_type_t = 3;
pub type vef_var_type_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct vef_sys_var_change_t {
    pub var_name: *const ::std::os::raw::c_char,
    pub type_: vef_var_type_t,
    pub __bindgen_anon_1: vef_sys_var_change_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vef_sys_var_change_t__bindgen_ty_1 {
    pub bool_val: bool,
    pub int_val: ::std::os::raw::c_longlong,
    pub dbl_val: f64,
    pub str_val: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vef_sys_var_change_t__bindgen_ty_1"]
        [::std::mem::size_of::<vef_sys_var_change_t__bindgen_ty_1>() - 8usize];
    ["Alignment of vef_sys_var_change_t__bindgen_ty_1"]
        [::std::mem::align_of::<vef_sys_var_change_t__bindgen_ty_1>() - 8usize];
    ["Offset of field: vef_sys_var_change_t__bindgen_ty_1::bool_val"]
        [::std::mem::offset_of!(vef_sys_var_change_t__bindgen_ty_1, bool_val) - 0usize];
    ["Offset of field: vef_sys_var_change_t__bindgen_ty_1::int_val"]
        [::std::mem::offset_of!(vef_sys_var_change_t__bindgen_ty_1, int_val) - 0usize];
    ["Offset of field: vef_sys_var_change_t__bindgen_ty_1::dbl_val"]
        [::std::mem::offset_of!(vef_sys_var_change_t__bindgen_ty_1, dbl_val) - 0usize];
    ["Offset of field: vef_sys_var_change_t__bindgen_ty_1::str_val"]
        [::std::mem::offset_of!(vef_sys_var_change_t__bindgen_ty_1, str_val) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vef_sys_var_change_t"][::std::mem::size_of::<vef_sys_var_change_t>() - 24usize];
    ["Alignment of vef_sys_var_change_t"][::std::mem::align_of::<vef_sys_var_change_t>() - 8usize];
    ["Offset of field: vef_sys_var_change_t::var_name"]
        [::std::mem::offset_of!(vef_sys_var_change_t, var_name) - 0usize];
    ["Offset of field: vef_sys_var_change_t::type_"]
        [::std::mem::offset_of!(vef_sys_var_change_t, type_) - 8usize];
};
pub type vef_sys_var_on_change_func_t =
    ::std::option::Option<unsafe extern "C" fn(arg1: *const vef_sys_var_change_t)>;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct vef_sys_var_desc_t {
    pub name: *const ::std::os::raw::c_char,
    pub comment: *const ::std::os::raw::c_char,
    pub type_: vef_var_type_t,
    pub on_change: vef_sys_var_on_change_func_t,
    pub __bindgen_anon_1: vef_sys_var_desc_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vef_sys_var_desc_t__bindgen_ty_1 {
    pub boolean: vef_sys_var_desc_t__bindgen_ty_1__bindgen_ty_1,
    pub integer: vef_sys_var_desc_t__bindgen_ty_1__bindgen_ty_2,
    pub dbl: vef_sys_var_desc_t__bindgen_ty_1__bindgen_ty_3,
    pub str_: vef_sys_var_desc_t__bindgen_ty_1__bindgen_ty_4,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vef_sys_var_desc_t__bindgen_ty_1__bindgen_ty_1 {
    pub value_ptr: *mut bool,
    pub def_val: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vef_sys_var_desc_t__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<vef_sys_var_desc_t__bindgen_ty_1__bindgen_ty_1>() - 16usize];
    ["Alignment of vef_sys_var_desc_t__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<vef_sys_var_desc_t__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: vef_sys_var_desc_t__bindgen_ty_1__bindgen_ty_1::value_ptr"][::std::mem::offset_of!(
        vef_sys_var_desc_t__bindgen_ty_1__bindgen_ty_1,
        value_ptr
    ) - 0usize];
    ["Offset of field: vef_sys_var_desc_t__bindgen_ty_1__bindgen_ty_1::def_val"]
        [::std::mem::offset_of!(vef_sys_var_desc_t__bindgen_ty_1__bindgen_ty_1, def_val) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vef_sys_var_desc_t__bindgen_ty_1__bindgen_ty_2 {
    pub value_ptr: *mut ::std::os::raw::c_longlong,
    pub def_val: ::std::os::raw::c_longlong,
    pub min_val: ::std::os::raw::c_longlong,
    pub max_val: ::std::os::raw::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vef_sys_var_desc_t__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::size_of::<vef_sys_var_desc_t__bindgen_ty_1__bindgen_ty_2>() - 32usize];
    ["Alignment of vef_sys_var_desc_t__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::align_of::<vef_sys_var_desc_t__bindgen_ty_1__bindgen_ty_2>() - 8usize];
    ["Offset of field: vef_sys_var_desc_t__bindgen_ty_1__bindgen_ty_2::value_ptr"][::std::mem::offset_of!(
        vef_sys_var_desc_t__bindgen_ty_1__bindgen_ty_2,
        value_ptr
    ) - 0usize];
    ["Offset of field: vef_sys_var_desc_t__bindgen_ty_1__bindgen_ty_2::def_val"]
        [::std::mem::offset_of!(vef_sys_var_desc_t__bindgen_ty_1__bindgen_ty_2, def_val) - 8usize];
    ["Offset of field: vef_sys_var_desc_t__bindgen_ty_1__bindgen_ty_2::min_val"]
        [::std::mem::offset_of!(vef_sys_var_desc_t__bindgen_ty_1__bindgen_ty_2, min_val) - 16usize];
    ["Offset of field: vef_sys_var_desc_t__bindgen_ty_1__bindgen_ty_2::max_val"]
        [::std::mem::offset_of!(vef_sys_var_desc_t__bindgen_ty_1__bindgen_ty_2, max_val) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vef_sys_var_desc_t__bindgen_ty_1__bindgen_ty_3 {
    pub value_ptr: *mut f64,
    pub def_val: f64,
    pub min_val: f64,
    pub max_val: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vef_sys_var_desc_t__bindgen_ty_1__bindgen_ty_3"]
        [::std::mem::size_of::<vef_sys_var_desc_t__bindgen_ty_1__bindgen_ty_3>() - 32usize];
    ["Alignment of vef_sys_var_desc_t__bindgen_ty_1__bindgen_ty_3"]
        [::std::mem::align_of::<vef_sys_var_desc_t__bindgen_ty_1__bindgen_ty_3>() - 8usize];
    ["Offset of field: vef_sys_var_desc_t__bindgen_ty_1__bindgen_ty_3::value_ptr"][::std::mem::offset_of!(
        vef_sys_var_desc_t__bindgen_ty_1__bindgen_ty_3,
        value_ptr
    ) - 0usize];
    ["Offset of field: vef_sys_var_desc_t__bindgen_ty_1__bindgen_ty_3::def_val"]
        [::std::mem::offset_of!(vef_sys_var_desc_t__bindgen_ty_1__bindgen_ty_3, def_val) - 8usize];
    ["Offset of field: vef_sys_var_desc_t__bindgen_ty_1__bindgen_ty_3::min_val"]
        [::std::mem::offset_of!(vef_sys_var_desc_t__bindgen_ty_1__bindgen_ty_3, min_val) - 16usize];
    ["Offset of field: vef_sys_var_desc_t__bindgen_ty_1__bindgen_ty_3::max_val"]
        [::std::mem::offset_of!(vef_sys_var_desc_t__bindgen_ty_1__bindgen_ty_3, max_val) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vef_sys_var_desc_t__bindgen_ty_1__bindgen_ty_4 {
    pub value_ptr: *mut *mut ::std::os::raw::c_char,
    pub def_val: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vef_sys_var_desc_t__bindgen_ty_1__bindgen_ty_4"]
        [::std::mem::size_of::<vef_sys_var_desc_t__bindgen_ty_1__bindgen_ty_4>() - 16usize];
    ["Alignment of vef_sys_var_desc_t__bindgen_ty_1__bindgen_ty_4"]
        [::std::mem::align_of::<vef_sys_var_desc_t__bindgen_ty_1__bindgen_ty_4>() - 8usize];
    ["Offset of field: vef_sys_var_desc_t__bindgen_ty_1__bindgen_ty_4::value_ptr"][::std::mem::offset_of!(
        vef_sys_var_desc_t__bindgen_ty_1__bindgen_ty_4,
        value_ptr
    ) - 0usize];
    ["Offset of field: vef_sys_var_desc_t__bindgen_ty_1__bindgen_ty_4::def_val"]
        [::std::mem::offset_of!(vef_sys_var_desc_t__bindgen_ty_1__bindgen_ty_4, def_val) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vef_sys_var_desc_t__bindgen_ty_1"]
        [::std::mem::size_of::<vef_sys_var_desc_t__bindgen_ty_1>() - 32usize];
    ["Alignment of vef_sys_var_desc_t__bindgen_ty_1"]
        [::std::mem::align_of::<vef_sys_var_desc_t__bindgen_ty_1>() - 8usize];
    ["Offset of field: vef_sys_var_desc_t__bindgen_ty_1::boolean"]
        [::std::mem::offset_of!(vef_sys_var_desc_t__bindgen_ty_1, boolean) - 0usize];
    ["Offset of field: vef_sys_var_desc_t__bindgen_ty_1::integer"]
        [::std::mem::offset_of!(vef_sys_var_desc_t__bindgen_ty_1, integer) - 0usize];
    ["Offset of field: vef_sys_var_desc_t__bindgen_ty_1::dbl"]
        [::std::mem::offset_of!(vef_sys_var_desc_t__bindgen_ty_1, dbl) - 0usize];
    ["Offset of field: vef_sys_var_desc_t__bindgen_ty_1::str_"]
        [::std::mem::offset_of!(vef_sys_var_desc_t__bindgen_ty_1, str_) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vef_sys_var_desc_t"][::std::mem::size_of::<vef_sys_var_desc_t>() - 64usize];
    ["Alignment of vef_sys_var_desc_t"][::std::mem::align_of::<vef_sys_var_desc_t>() - 8usize];
    ["Offset of field: vef_sys_var_desc_t::name"]
        [::std::mem::offset_of!(vef_sys_var_desc_t, name) - 0usize];
    ["Offset of field: vef_sys_var_desc_t::comment"]
        [::std::mem::offset_of!(vef_sys_var_desc_t, comment) - 8usize];
    ["Offset of field: vef_sys_var_desc_t::type_"]
        [::std::mem::offset_of!(vef_sys_var_desc_t, type_) - 16usize];
    ["Offset of field: vef_sys_var_desc_t::on_change"]
        [::std::mem::offset_of!(vef_sys_var_desc_t, on_change) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vef_sys_var_descriptor_list_t {
    pub vars: *const *const vef_sys_var_desc_t,
    pub var_count: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vef_sys_var_descriptor_list_t"]
        [::std::mem::size_of::<vef_sys_var_descriptor_list_t>() - 16usize];
    ["Alignment of vef_sys_var_descriptor_list_t"]
        [::std::mem::align_of::<vef_sys_var_descriptor_list_t>() - 8usize];
    ["Offset of field: vef_sys_var_descriptor_list_t::vars"]
        [::std::mem::offset_of!(vef_sys_var_descriptor_list_t, vars) - 0usize];
    ["Offset of field: vef_sys_var_descriptor_list_t::var_count"]
        [::std::mem::offset_of!(vef_sys_var_descriptor_list_t, var_count) - 8usize];
};
pub type vef_sys_var_get_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        component_name: *const ::std::os::raw::c_char,
        name: *const ::std::os::raw::c_char,
        val: *mut *mut ::std::os::raw::c_void,
        val_len: *mut usize,
    ) -> bool,
>;
pub type vef_sys_var_set_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        component_name: *const ::std::os::raw::c_char,
        name: *const ::std::os::raw::c_char,
        scope: *const ::std::os::raw::c_char,
        val: *const ::std::os::raw::c_char,
    ) -> bool,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vef_preview_sys_var_t {
    pub version: u32,
    pub get: vef_sys_var_get_func_t,
    pub set: vef_sys_var_set_func_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vef_preview_sys_var_t"][::std::mem::size_of::<vef_preview_sys_var_t>() - 24usize];
    ["Alignment of vef_preview_sys_var_t"]
        [::std::mem::align_of::<vef_preview_sys_var_t>() - 8usize];
    ["Offset of field: vef_preview_sys_var_t::version"]
        [::std::mem::offset_of!(vef_preview_sys_var_t, version) - 0usize];
    ["Offset of field: vef_preview_sys_var_t::get"]
        [::std::mem::offset_of!(vef_preview_sys_var_t, get) - 8usize];
    ["Offset of field: vef_preview_sys_var_t::set"]
        [::std::mem::offset_of!(vef_preview_sys_var_t, set) - 16usize];
};
