/* automatically generated by rust-bindgen 0.71.1 */

pub const VEF_PREVIEW_KEYRING_NAME: &[u8; 23] = b"vsql::preview::keyring\0";
pub const VEF_PREVIEW_KEYRING_ABI_VERSION: u32 = 1;
pub const vef_keyring_result_t_VEF_KEYRING_OK: vef_keyring_result_t = 0;
pub const vef_keyring_result_t_VEF_KEYRING_NOT_FOUND: vef_keyring_result_t = 1;
pub const vef_keyring_result_t_VEF_KEYRING_UNAVAILABLE: vef_keyring_result_t = 2;
pub const vef_keyring_result_t_VEF_KEYRING_ERROR: vef_keyring_result_t = 3;
pub type vef_keyring_result_t = ::std::os::raw::c_uint;
pub type vef_read_keyring_fn = ::std::option::Option<
    unsafe extern "C" fn(
        data_id: *const ::std::os::raw::c_char,
        auth_id: *const ::std::os::raw::c_char,
        buf: *mut ::std::os::raw::c_uchar,
        buf_len: usize,
        out_len: *mut usize,
    ) -> vef_keyring_result_t,
>;
pub type vef_write_keyring_fn = ::std::option::Option<
    unsafe extern "C" fn(
        data_id: *const ::std::os::raw::c_char,
        auth_id: *const ::std::os::raw::c_char,
        data: *const ::std::os::raw::c_uchar,
        data_len: usize,
    ) -> vef_keyring_result_t,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vef_preview_keyring_t {
    pub version: u32,
    pub read: vef_read_keyring_fn,
    pub write: vef_write_keyring_fn,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vef_preview_keyring_t"][::std::mem::size_of::<vef_preview_keyring_t>() - 24usize];
    ["Alignment of vef_preview_keyring_t"]
        [::std::mem::align_of::<vef_preview_keyring_t>() - 8usize];
    ["Offset of field: vef_preview_keyring_t::version"]
        [::std::mem::offset_of!(vef_preview_keyring_t, version) - 0usize];
    ["Offset of field: vef_preview_keyring_t::read"]
        [::std::mem::offset_of!(vef_preview_keyring_t, read) - 8usize];
    ["Offset of field: vef_preview_keyring_t::write"]
        [::std::mem::offset_of!(vef_preview_keyring_t, write) - 16usize];
};
