/* automatically generated by rust-bindgen 0.71.1 */

pub const VEF_PREVIEW_STATUS_VAR_NAME: &[u8; 17] = b"vsql::status_var\0";
pub const VEF_PREVIEW_STATUS_VAR_ABI_VERSION: u32 = 1;
pub const vef_status_var_type_t_VEF_STATUS_VAR_INT: vef_status_var_type_t = 0;
pub const vef_status_var_type_t_VEF_STATUS_VAR_DOUBLE: vef_status_var_type_t = 1;
pub type vef_status_var_type_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct vef_status_var_desc_t {
    pub name: *const ::std::os::raw::c_char,
    pub type_: vef_status_var_type_t,
    pub __bindgen_anon_1: vef_status_var_desc_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vef_status_var_desc_t__bindgen_ty_1 {
    pub integer_ptr: *mut ::std::os::raw::c_longlong,
    pub double_ptr: *mut f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vef_status_var_desc_t__bindgen_ty_1"]
        [::std::mem::size_of::<vef_status_var_desc_t__bindgen_ty_1>() - 8usize];
    ["Alignment of vef_status_var_desc_t__bindgen_ty_1"]
        [::std::mem::align_of::<vef_status_var_desc_t__bindgen_ty_1>() - 8usize];
    ["Offset of field: vef_status_var_desc_t__bindgen_ty_1::integer_ptr"]
        [::std::mem::offset_of!(vef_status_var_desc_t__bindgen_ty_1, integer_ptr) - 0usize];
    ["Offset of field: vef_status_var_desc_t__bindgen_ty_1::double_ptr"]
        [::std::mem::offset_of!(vef_status_var_desc_t__bindgen_ty_1, double_ptr) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vef_status_var_desc_t"][::std::mem::size_of::<vef_status_var_desc_t>() - 24usize];
    ["Alignment of vef_status_var_desc_t"]
        [::std::mem::align_of::<vef_status_var_desc_t>() - 8usize];
    ["Offset of field: vef_status_var_desc_t::name"]
        [::std::mem::offset_of!(vef_status_var_desc_t, name) - 0usize];
    ["Offset of field: vef_status_var_desc_t::type_"]
        [::std::mem::offset_of!(vef_status_var_desc_t, type_) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vef_status_var_descriptor_list_t {
    pub vars: *const *const vef_status_var_desc_t,
    pub var_count: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vef_status_var_descriptor_list_t"]
        [::std::mem::size_of::<vef_status_var_descriptor_list_t>() - 16usize];
    ["Alignment of vef_status_var_descriptor_list_t"]
        [::std::mem::align_of::<vef_status_var_descriptor_list_t>() - 8usize];
    ["Offset of field: vef_status_var_descriptor_list_t::vars"]
        [::std::mem::offset_of!(vef_status_var_descriptor_list_t, vars) - 0usize];
    ["Offset of field: vef_status_var_descriptor_list_t::var_count"]
        [::std::mem::offset_of!(vef_status_var_descriptor_list_t, var_count) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vef_preview_status_var_t {
    pub version: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vef_preview_status_var_t"]
        [::std::mem::size_of::<vef_preview_status_var_t>() - 4usize];
    ["Alignment of vef_preview_status_var_t"]
        [::std::mem::align_of::<vef_preview_status_var_t>() - 4usize];
    ["Offset of field: vef_preview_status_var_t::version"]
        [::std::mem::offset_of!(vef_preview_status_var_t, version) - 0usize];
};
