/* automatically generated by rust-bindgen 0.71.1 */

pub const VEF_PREVIEW_THREAD_WORKER_NAME: &[u8; 29] = b"vsql::preview::thread_worker\0";
pub const VEF_PREVIEW_THREAD_WORKER_ABI_VERSION: u32 = 1;
pub const vef_wakeup_reason_t_VEF_WAKEUP_ENABLE: vef_wakeup_reason_t = 0;
pub const vef_wakeup_reason_t_VEF_WAKEUP_PERIODIC: vef_wakeup_reason_t = 1;
pub const vef_wakeup_reason_t_VEF_WAKEUP_POLL_FD: vef_wakeup_reason_t = 2;
pub const vef_wakeup_reason_t_VEF_WAKEUP_DISABLE: vef_wakeup_reason_t = 3;
pub type vef_wakeup_reason_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vef_thread_handle_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vef_next_wakeup_t {
    pub sleep_ms: ::std::os::raw::c_uint,
    pub poll_fd: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vef_next_wakeup_t"][::std::mem::size_of::<vef_next_wakeup_t>() - 8usize];
    ["Alignment of vef_next_wakeup_t"][::std::mem::align_of::<vef_next_wakeup_t>() - 4usize];
    ["Offset of field: vef_next_wakeup_t::sleep_ms"]
        [::std::mem::offset_of!(vef_next_wakeup_t, sleep_ms) - 0usize];
    ["Offset of field: vef_next_wakeup_t::poll_fd"]
        [::std::mem::offset_of!(vef_next_wakeup_t, poll_fd) - 4usize];
};
pub type vef_work_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        reason: vef_wakeup_reason_t,
        thread: *mut vef_thread_handle_t,
        arg: *mut ::std::os::raw::c_void,
    ) -> vef_next_wakeup_t,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vef_thread_worker_descriptor_t {
    pub work_fn: vef_work_fn_t,
    pub arg: *mut ::std::os::raw::c_void,
    pub sleep_ms: ::std::os::raw::c_uint,
    pub suffix: *const ::std::os::raw::c_char,
    pub var_name: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vef_thread_worker_descriptor_t"]
        [::std::mem::size_of::<vef_thread_worker_descriptor_t>() - 40usize];
    ["Alignment of vef_thread_worker_descriptor_t"]
        [::std::mem::align_of::<vef_thread_worker_descriptor_t>() - 8usize];
    ["Offset of field: vef_thread_worker_descriptor_t::work_fn"]
        [::std::mem::offset_of!(vef_thread_worker_descriptor_t, work_fn) - 0usize];
    ["Offset of field: vef_thread_worker_descriptor_t::arg"]
        [::std::mem::offset_of!(vef_thread_worker_descriptor_t, arg) - 8usize];
    ["Offset of field: vef_thread_worker_descriptor_t::sleep_ms"]
        [::std::mem::offset_of!(vef_thread_worker_descriptor_t, sleep_ms) - 16usize];
    ["Offset of field: vef_thread_worker_descriptor_t::suffix"]
        [::std::mem::offset_of!(vef_thread_worker_descriptor_t, suffix) - 24usize];
    ["Offset of field: vef_thread_worker_descriptor_t::var_name"]
        [::std::mem::offset_of!(vef_thread_worker_descriptor_t, var_name) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vef_preview_thread_worker_t {
    pub version: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vef_preview_thread_worker_t"]
        [::std::mem::size_of::<vef_preview_thread_worker_t>() - 4usize];
    ["Alignment of vef_preview_thread_worker_t"]
        [::std::mem::align_of::<vef_preview_thread_worker_t>() - 4usize];
    ["Offset of field: vef_preview_thread_worker_t::version"]
        [::std::mem::offset_of!(vef_preview_thread_worker_t, version) - 0usize];
};
